/*Вы вводите занчение 30 > a > 1e-6"
 Программа ищет член последовательности Xn, при котором (5/4)*a*|Xn - Xn-1|<10^-6
 После вычисляется значение выражения a-Xn^5
 Программа - Рекурсия 
 Выполнил Дербилов Владимир Дмитриевич
  */

#include <iostream>  
#include <math.h>  
#include <iomanip>  
#include <conio.h>  
#include <locale.h> 
#include <string>
#include <fstream>  

using namespace std;

void input(double& a, double& b) //Ввод данных через консоль 
{
	do
	{
		cout << "Введите значение 1e-6 < a <= 30 --> ";
		cin >> a;
		cout << endl;
		if ((a <= 1e-6) || (a > 30))
		{
			cout << endl << "Данное значение неверно, Повторите ввод" << endl;
		}
		if (cin.fail())
		{
			cout << endl << "Данное значение неверно, Повторите ввод" << endl;
			cin.clear();
			cin.ignore(32767, '\n'); //Защита от ввода символов 
			a = 40;
		}
	} while ((a <= 1e-6) || (a > 30));

	do
	{
		cout << "Введите область сходимости 1e-6 < b <= 1 --> ";
		cin >> b;
		cout << endl;
		if ((b <= 1e-6) || (b > 1))
		{
			cout << endl << "Данное значение неверно, Повторите ввод" << endl;
		}
		if (cin.fail())
		{
			cout << endl << "Данное значение неверно, Повторите ввод" << endl;
			cin.clear();
			cin.ignore(32767, '\n'); //Защита от ввода символов 
			b = 2;
		}
	} while ((b <= 1e-6) || (b > 1));
}

void inputfile(double& a, double& b)//Ввод данных через файл
{
	ifstream fin;
	fin.open("input.txt");
	fin >> (a);
	fin >> (b);
	cout << "a=" << (a) << endl;
	cout << "b=" << (b) << endl;
	cout << endl;
	fin.close();
}

void zikl(double& a, double& b, double& v, double& rez, double& x2, double& n)
{
	double x1 = 0;
	x2 = 0, v = 0, rez = 0, n = 0;
	int i;
	do
	{
		cout << "Если вы хотите, видеть вычисления и результат в консоли, нажмите 1, если хотите видеть только результат, нажмите 2" << endl;
		cin >> i;
		if ((i != 1) && (i != 2))
		{
			cout << "Данное значение неверно, повторите ввод" << endl;
		}
		if (cin.fail())
		{
			cout << endl << "Данное значение неверно, повторите ввод" << endl;
			cin.clear();
			cin.ignore(32767, '\n'); /*Защита от ввода символов*/
			i = -1;
		}
	} while ((i != 1) && (i != 2));
	do
	{
		if (i == 1)
		{
			cout << "Вычисление №" << n + 1 << endl;
		}
		if (n == 0)
		{
			if (a <= 1)
			{
				if (2 * a < 0.95)
				{
					x1 = 2 * a;
					if (i == 1)
					{
						cout << "x1=2*a --> x1 = " << x1 << endl;
					}
				}
				else
				{
					x1 = 0.95;
					if (i == 1)
					{
						cout << "2a>0.95 --> x1 = " << x1 << endl;
					}
				}
			}
			if ((a > 1) && (a <= 25))
			{
				x1 = (a) / 5;
				if (i == 1)
				{
					cout << "x1=a/5 --> x1 = " << x1 << endl;
				}
			}
			if (a > 25)
			{
				x1 = a / 25;
				if (i == 1)
				{
					cout << "x1=a/25 --> x1 = " << x1 << endl;
				}
			}
			x2 = (a / 5) * x1 + (4 / (5 * pow(x1, 4)));
			if (i == 1)
			{
				cout << "x2= " << x2 << endl;
			}
		}
		if ((n > 0) || (n < 1000))
		{
			x2 = (a / 5) * x1 + (4 / (5 * pow(x1, 4)));
			if (i == 1)
			{
				cout << "x1= " << x1 << endl;
				cout << "x2= " << x2 << endl;
			}
		}
		v = 1.25 * a * fabs(x2 - x1);
		if (i == 1)
		{
			cout << "v= " << v << endl;
		}
		if (n >= 1000)
		{
			v = 1e-10;
		}
		if (v < b)
		{
			cout << " выход из цикла " << endl;
		}
		else
		{
			x1 = x2;
			x2 = 0;
			if (i == 1)
			{
				cout << "(5/4)*a*|x2 - x1| > b" << endl << endl;
			}
		}
		n++;
		rez = a - pow(x2, 5);
	} while (v > b);
	if (v == 1e-10)
	{
		cout << endl;
		cout << "Ряд расходится" << endl << endl;
		n = 0, x1 = 0, x2 = 0, i = 0, v = 1e-10, rez = 0;
	}
	else
	{
		cout << endl << "Первый член последовательности Xn при котором (5/4)*a*|Xn - Xn-1| < " << b << " --> X" << n << " = " << x2 << endl;
		cout << "В результате работы программы при помощи цикла получилось следующее занчение a-Xn^5= " << rez << endl;
	}
}


void rekurs(double& a, double& b, double& v, double& rez, double& x2, double& n)
{

	static int i = 0;
	static double x1, x22, v1, rez1, n1 = 0;

	if ((i != 1) && (i != 2))
	{
		x2 = 0, rez = 0, v = 0, n = 0;
		do
		{
			cout << "Если вы хотите, видеть вычисления и результат в консоли, нажмите 1, если хотите видеть только результат, нажмите 2" << endl;
			cin >> i;
			if ((i != 1) && (i != 2))
			{
				cout << "Данное значение неверно, повторите ввод" << endl;
			}
			if (cin.fail())
			{
				cout << endl << "Данное значение неверно, повторите ввод" << endl;
				cin.clear();
				cin.ignore(32767, '\n');
				i = -1;
			}
		} while ((i != 1) && (i != 2));
	}

	if (i == 1)
	{
		cout << "Вычисление №" << n1 + 1 << endl;
	}
	if (n1 == 0)
	{
		if (a <= 1)
		{
			if (2 * a < 0.95)
			{
				x1 = 2 * a;
				if (i == 1)
				{
					cout << "x1=2*a --> x1 = " << x1 << endl;
				}
			}
			else
			{
				x1 = 0.95;
				if (i == 1)
				{
					cout << "2a>0.95 --> x1 = " << x1 << endl;
				}
			}
		}
		if ((a > 1) && (a <= 25))
		{
			x1 = a / 5;
			if (i == 1)
			{
				cout << "x1=a/5 --> x1 = " << x1 << endl;
			}
		}
		if (a > 25)
		{
			x1 = a / 25;
			if (i == 1)
			{
				cout << "x1=a/25 --> x1 = " << x1 << endl;
			}
		}
		x22 = (a / 5) * x1 + (4 / (5 * pow(x1, 4)));
		v1 = 1.25 * a * fabs(x22 - x1);
		if (i == 1)
		{
			cout << "x2= " << x22 << endl;
			cout << "v= " << v1 << endl;
		}
	}
	if ((n1 > 0) || (n1 < 1000))
	{
		x22 = (a / 5) * x1 + (4 / (5 * pow(x1, 4)));
		v1 = 1.25 * a * fabs(x22 - x1);
		if (i == 1)
		{
			cout << "x1= " << x1 << endl;
			cout << "x2= " << x22 << endl;
			cout << "v= " << v1 << endl;
		}
	}
	if (n1 >= 1000)
	{
		v1 = 1e-10;
	}
	if (v1 > b)
	{
		x1 = x22;
		x22 = 0;
		if (i == 1)
		{
			cout << "(5/4)*a*|x2 - x1| > " << b << endl;
		}
		n1++;
		return rekurs(a, b, rez, v, x2, n);
	}
	else
	{
		if (v1 == 1e-10)
		{
			cout << "Ряд расходится" << endl;
			n = 0, x1 = 0, x2 = 0, i = 0, v = v1, rez = 0, n1 = 0, x22 = 0, rez1 = 0, v1 = 0;
		}
		else
		{
			n1 + 1;
			cout << endl;
			cout << "выход из рекурсивной функции " << endl;
			cout << "Первый член последовательности Xn при котором (5/4)*a*|Xn - Xn-1| < " << b << " --> X" << n1 + 1 << " = " << x22 << endl;
			rez1 = a - pow(x22, 5);
			cout << "В результате работы программы при помощи цикла получилось следующее занчение a-Xn^5= " << rez1 << endl;
			n = (1 + n1); x2 = x22; v = v1; rez = rez1; i = 0, n1 = 0, x22 = 0, rez1 = 0, v1 = 0;
			cout << ";";
		}
	}
}
void output(double& a, double& b, double& v, double& rez, double& x2, double& n)//Вывод данных на экран 
{
	int ch;
	do
	{
		cout << "Если вы хотите, вывод  в консоли, нажмите 1, если вы хотите вывод в файл, нажмите 2" << endl;
		cin >> ch;
		if ((ch != 1) && (ch != 2))
		{
			cout << "Данное значение неверно, повторите ввод" << endl;
		}
		if (cin.fail())
		{
			cout << endl << "Данное значение неверно, повторите ввод" << endl;
			cin.clear();
			cin.ignore(32767, '\n');
			ch = -1;
		}
	} while ((ch != 1) && (ch != 2));

	if (ch == 1)
	{
		if (v == 1e-10)
		{
			cout << "Ряд расходится" << endl;
		}
		else
		{
			cout << "Результаты будут выведены в консоль" << endl;
			cout << "Параметр A=" << a << endl;
			cout << "Параметр точности B=" << b << endl;
			cout << "Выражение (5/4)*a*|Xn - Xn-1|=" << v << endl;
			cout << "Первый член последовательности Xn при котором (5/4)*a*|Xn - Xn-1| < " << b << " --> X" << n << " = " << x2 << endl;
			cout << "В результате работы программы получилось следующее занчение a-Xn^5= " << rez << endl;
		}
	}
	if (ch == 2)
	{
		ofstream fout;
		fout.open("rezultat.txt", ios::app);

		cout << "В корневой папке программы находится файл с результатами rezultat.txt" << endl;
		if (v == 1e-10)
		{
			fout << "Ряд расходится" << endl;
		}
		else
		{
			fout << "Параметр A=" << a << endl;
			fout << "Параметр точности B=" << b << endl;
			fout << "Выражение (5/4)*a*|Xn - Xn-1|=" << v << endl;
			fout << "Первый член последовательности Xn при котором (5/4)*a*|Xn - Xn-1| < " << b << " --> X" << n << " = " << x2 << endl;
			fout << "В результате работы программы получилось следующее занчение a-Xn^5= " << rez << endl;
			fout.close();
		}
	}
}
void about() //Вывод данных о разработчике и о программе
{

	cout << "Вы вводите значение 1e-6 < a <= 30" << endl;
	cout << "Вы вводите значение 1e-6 < b <= 1" << endl;
	cout << "Программа ищет член последовательности Xn, при котором (5/4)*a*|Xn - Xn-1| < b" << endl;
	cout << "После вычисляется значение выражения a-Xn^5" << endl ;
	cout << "Программа - Рекурсия " << endl;
	cout << "Выполнил Дербилов Владимир Дмитриевич" << endl;

}

void help() //Справка
{
	cout << setw(10) << " " << "Помощь" << endl;
	cout << "Для ввода данных нажмите 1 " << endl;
	cout << "Далее, для выхода из раздела нажмите любую клавишу " << endl;
	cout << "Для ввода данных через файл нажмите 2 " << endl;
	cout << "Для РЕШЕНИЯ задания методом рекурсии нажмите 3 " << endl;
	cout << "Для ПРОВЕРКИ решения с помощью цикла нажмите 4 " << endl;
	cout << "Чтобы вывести результат работы программы на экран или в файл, нажмите 5 " << endl;
	cout << "Чтобы открыть справку с содержанием данных о программе и о создателе нажмите 6 " << endl;
	cout << "Если у вас возникли проблемы, откройте справку, для этого нажмите 7 " << endl;
	cout << "Далее, для выхода из раздела помощь нажмите любую клавишу " << endl;
	cout << "Для выхода из программы нажмите цифру 8 " << endl;
}
